app/controllers/user_stocks_controller.rb

  def create
    stock = Stock.find_by_ticker(params[:stock_ticker])
    if stock.blank?
      stock = Stock.new_from_lookup(params[:stock_ticker])
      stock.save
    end
    @user_stock = UserStock.create(user: current_user, stock: stock)
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ? ORDER BY "stocks"."id" ASC LIMIT ?  [["ticker", "GOOG"], ["LIMIT", 1]]
INSERT INTO "user_stocks" ("user_id", "stock_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["stock_id", 1], ["created_at", "2019-12-31 10:44:33.103668"], ["updated_at", "2019-12-31 10:44:33.103668"]]

  def destroy
    stock = UserStock.where(user_id: current_user.id, stock_id: params[:id]).first
    stock.destroy
---
SELECT "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."user_id" = ? AND "user_stocks"."stock_id" = ? ORDER BY "user_stocks"."id" ASC LIMIT ?  [["user_id", 1], ["stock_id", 1], ["LIMIT", 1]]
DELETE FROM "user_stocks" WHERE "user_stocks"."id" = ?  [["id", 1]]