app/controllers/users_controller.rb

  def search
    if params[:search_param].blank?
      flash.now[:danger] = "You have entered an empty search string"
    else
      @users = User.search(params[:search_param])
---
SELECT "users".* FROM "users" WHERE (first_name like '%pra%')

  def add_friend
   @friend = User.find(params[:friend])
   current_user.friendships.build(friend_id: @friend.id)
   if current_user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 1], ["created_at", "2019-12-31 13:00:18.300313"], ["updated_at", "2019-12-31 13:00:18.300313"]]