app/models/stock.rb

  def self.find_by_ticker(ticker_symbol)
    where(ticker: ticker_symbol).first
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ? ORDER BY "stocks"."id" ASC LIMIT ?  [["ticker", "GOOG"], ["LIMIT", 1]]