app/models/user.rb

SELECT 1 AS one FROM "user_stocks" WHERE "user_stocks"."user_id" = ? AND "user_stocks"."stock_id" = ? LIMIT ?  [["user_id", 1], ["stock_id", 1], ["LIMIT", 1]]
---
  def stock_already_added?(ticker_symbol)
    stock = Stock.find_by_ticker(ticker_symbol)
    return false unless stock
    user_stocks.where(stock_id: stock.id).exists?

SELECT "users".* FROM "users" WHERE (email like '%prabhu@gmail.com%')
---
  def self.search(param)

SELECT "users".* FROM "users" WHERE (first_name like '%prab%')
---
  def self.first_name_matches(param)